1. Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import pandas as pd

In [5]:
film = pd.read_csv('movies.csv')
film[['movieId','title']].head()

   movieId                               title
0        1                    Toy Story (1995)
1        2                      Jumanji (1995)
2        3             Grumpier Old Men (1995)
3        4            Waiting to Exhale (1995)
4        5  Father of the Bride Part II (1995)

In [6]:
reiting = pd.read_csv('ratings.csv')
reiting[['movieId','rating']]

          movieId  rating
0             296     5.0
1             306     3.5
2             307     5.0
3             665     5.0
4             899     3.5
...           ...     ...
25000090    50872     4.5
25000091    55768     2.5
25000092    56176     2.0
25000093    58559     4.0
25000094    63876     5.0

[25000095 rows x 2 columns]

In [8]:
joined = reiting.merge(film, on ='movieId', how ='left')
joined[['movieId','rating','title']].head()

   movieId  rating                                             title
0      296     5.0                               Pulp Fiction (1994)
1      306     3.5  Three Colors: Red (Trois couleurs: Rouge) (1994)
2      307     5.0  Three Colors: Blue (Trois couleurs: Bleu) (1993)
3      665     5.0                                Underground (1995)
4      899     3.5                        Singin' in the Rain (1952)

In [17]:
max_= reiting['rating'].max()
filtered_joined = joined[(joined ['rating'] == max_)]
fjg = filtered_joined.groupby(['movieId' , 'title'])['movieId'].count()

In [18]:
fjg.sort_values(ascending=False).head()

movieId  title
318      Shawshank Redemption, The (1994)             39553
296      Pulp Fiction (1994)                          32169
356      Forrest Gump (1994)                          25918
260      Star Wars: Episode IV - A New Hope (1977)    25804
2571     Matrix, The (1999)                           25482
Name: movieId, dtype: int64

Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [14]:
sila = pd.read_csv('power.csv')
sila.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [16]:
filtered_country = sila[(sila['country']=='Estonia') | (sila['country']=='Lithuania') | (sila['country']=='Latvia') ]
filtered_country.head()

       country  year  quantity  category
373  Lithuania  2014      39.0         1
374  Lithuania  2013     192.0         1
375  Lithuania  2012     196.0         1
376  Lithuania  2011     171.0         1
377  Lithuania  2010     158.0         1

In [19]:
fc = filtered_country[(filtered_country['category']==4) | (filtered_country['category']==12) | (filtered_country['category']==21) & (filtered_country['year']<2010) & (filtered_country['year']>2005)]

In [21]:
print('Суммарное потребление для Латвии, Литвы и Эстонии по категориям 4, 12 и 21 за период с 2005 по 2010 года равно {}'.format(fc['quantity'].sum()))

Суммарное потребление для Латвии, Литвы и Эстонии по категориям 4, 12 и 21 за период с 2005 по 2010 года равно 165867.0

Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.

In [23]:
danie = pd.read_html('https://www.finanz.ru/valyuty/v-realnom-vremeni', encoding='utf-8')[1]
danie.head()

,Unnamed: 0,Рубль,Предложение,Спрос,Предыдущее закрытие,%,Абсолютное значение,Время
0,NaN,GBP/RUB,1041581,-,1042611,"-0,10 %",-01029,07:59:00
1,NaN,EUR/RUB,905005,-,905720,"-0,08 %",-00715,07:59:00
2,NaN,USD/RUB,746909,-,747490,"-0,08 %",-00581,07:59:00
3,NaN,JPY/RUB,06865,-,06865,"0,00 %",00000,07:59:00
4,NaN,CNY/RUB,115469,-,115547,"-0,07 %",-00078,07:58:00